src/cfe/КСП/InformationRegisters/ксп_МэппингСправочникВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.16">
	<InformationRegister>
		<Properties>
			<Name>ксп_МэппингСправочникВидыНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Соответствие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипСоответствия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВнешняяСистема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидВоспроизводства</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cfe/КСП/InformationRegisters/ксп_МэппингСправочникВидыНоменклатуры/Ext/ManagerModule.bsl
Функция ПоМэппингу (ТипСоответствия, Соответствие, ВнешняяСистема, ВидВоспроизводства) Экспорт

 Запрос = Новый запрос;
 Запрос.Текст = 
 "ВЫБРАТЬ
 |	ксп_МэппингСправочникВидыНоменклатуры.ВидНоменклатуры КАК ВидНоменклатуры
 |ИЗ
 |	РегистрСведений.ксп_МэппингСправочникВидыНоменклатуры КАК ксп_МэппингСправочникВидыНоменклатуры
 |ГДЕ
 |	ксп_МэппингСправочникВидыНоменклатуры.ТипСоответствия = &ТипСоответствия
 |	И ксп_МэппингСправочникВидыНоменклатуры.Соответствие = &Соответствие
 |	И ксп_МэппингСправочникВидыНоменклатуры.ВнешняяСистема = &ВнешняяСистема
 |	И ксп_МэппингСправочникВидыНоменклатуры.ВидВоспроизводства = &ВидВоспроизводства";
 
 Запрос.УстановитьПараметр("ТипСоответствия", ТипСоответствия);
 Запрос.УстановитьПараметр("Соответствие", Соответствие);
 Запрос.УстановитьПараметр("ВнешняяСистема", ВнешняяСистема);
 Запрос.УстановитьПараметр("ВидВоспроизводства", ВидВоспроизводства);
 
 Результат = Запрос.Выполнить(); 
 
 Выборка = Результат.Выбрать(); 
 
 Пока Выборка.Следующий() Цикл
	 
	 Возврат Выборка.ВидНоменклатуры;
	 
 КонецЦикла; 
 
 Возврат Справочники.ВидыНоменклатуры.ПустаяСсылка();
 
КонецФункции
